NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAM3X8H.svd
        <register>
          <name>ADDR</name>
          <description>SMC NFC Address Cycle Zero Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR_CYCLE0</name>
              <description>NAND Flash Array Address cycle 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BANK</name>
          <description>SMC Bank Address Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BANK</name>
              <description>Bank Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_CTRL</name>
          <description>SMC ECC Control Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RST</name>
              <description>Reset ECC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_MD</name>
          <description>SMC ECC Mode Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC_PAGESIZE</name>
              <description>ECC Page Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PS512</name>
                  <description>Main area 512 Words</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS1024</name>
                  <description>Main area 1024 Words</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS2048</name>
                  <description>Main area 2048 Words</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS4096</name>
                  <description>Main area 4096 Words</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TYPCORREC</name>
              <description>Type of Correction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPAGE</name>
                  <description>1 bit correction for a page of 512/1024/2048/4096 Bytes  (for 8 or 16-bit NAND Flash)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C256B</name>
                  <description>1 bit correction for 256 Bytes of data for a page of 512/2048/4096 bytes (for 8-bit NAND Flash only)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C512B</name>
                  <description>1 bit correction for 512 Bytes of data for a page of 512/2048/4096 bytes (for 8-bit NAND Flash only)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_SR1</name>
          <description>SMC ECC Status 1 Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RECERR0</name>
              <description>Recoverable Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR0</name>
              <description>ECC Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR0</name>
              <description>Multiple Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR1</name>
              <description>Recoverable Error in the page between the 256th and the 511th bytes or the 512nd and the 1023rd bytes</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR1</name>
              <description>ECC Error in the page between the 256th and the 511th bytes or between the 512nd and the 1023rd bytes</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR1</name>
              <description>Multiple Error in the page between the 256th and the 511th bytes or between the 512nd and the 1023rd bytes</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR2</name>
              <description>Recoverable Error in the page between the 512nd and the 767th bytes or between the 1024th and the 1535th bytes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR2</name>
              <description>ECC Error in the page between the 512nd and the 767th bytes or between the 1024th and the 1535th bytes</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR2</name>
              <description>Multiple Error in the page between the 512nd and the 767th bytes or between the 1024th and the 1535th bytes</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR3</name>
              <description>Recoverable Error in the page between the 768th and the 1023rd bytes or between the 1536th and the 2047th bytes</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR3</name>
              <description>ECC Error in the page between the 768th and the 1023rd bytes or between the 1536th and the 2047th bytes</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR3</name>
              <description>Multiple Error in the page between the 768th and the 1023rd bytes or between the 1536th and the 2047th bytes</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR4</name>
              <description>Recoverable Error in the page between the 1024th and the 1279th bytes or between the 2048th and the 2559th bytes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR4</name>
              <description>ECC Error in the page between the 1024th and the 1279th bytes or between the 2048th and the 2559th bytes</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR4</name>
              <description>Multiple Error in the page between the 1024th and the 1279th bytes or between the 2048th and the 2559th bytes</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR5</name>
              <description>Recoverable Error in the page between the 1280th and the 1535th bytes or between the 2560th and the 3071st bytes</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR5</name>
              <description>ECC Error in the page between the 1280th and the 1535th bytes or between the 2560th and the 3071st bytes</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR5</name>
              <description>Multiple Error in the page between the 1280th and the 1535th bytes or between the 2560th and the 3071st bytes</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR6</name>
              <description>Recoverable Error in the page between the 1536th and the 1791st bytes or between the 3072nd and the 3583rd bytes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR6</name>
              <description>ECC Error in the page between the 1536th and the 1791st bytes or between the 3072nd and the 3583rd bytes</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR6</name>
              <description>Multiple Error in the page between the 1536th and the 1791st bytes or between the 3072nd and the 3583rd bytes</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR7</name>
              <description>Recoverable Error in the page between the 1792nd and the 2047th bytes or between the 3584th and the 4095th bytes</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR7</name>
              <description>ECC Error in the page between the 1792nd and the 2047th bytes or between the 3584th and the 4095th bytes</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR7</name>
              <description>Multiple Error in the page between the 1792nd and the 2047th bytes or between the 3584th and the 4095th bytes</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR0</name>
          <description>SMC ECC Parity 0 Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Bit Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Word Address</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR0_W9BIT</name>
          <description>SMC ECC Parity 0 Register</description>
          <alternateGroup>W9BIT</alternateGroup>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR0_W8BIT</name>
          <description>SMC ECC Parity 0 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR1</name>
          <description>SMC ECC parity 1 Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR1_W9BIT</name>
          <description>SMC ECC parity 1 Register</description>
          <alternateGroup>W9BIT</alternateGroup>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR1_W8BIT</name>
          <description>SMC ECC parity 1 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
