NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAM3X8H.svd
        <register>
          <name>ECC_PR9</name>
          <description>SMC ECC parity 9 Register</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR10</name>
          <description>SMC ECC parity 10 Register</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR11</name>
          <description>SMC ECC parity 11 Register</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR12</name>
          <description>SMC ECC parity 12 Register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR13</name>
          <description>SMC ECC parity 13 Register</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR14</name>
          <description>SMC ECC parity 14 Register</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR15</name>
          <description>SMC ECC parity 15 Register</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP0</name>
          <description>SMC Setup Register (CS_number = 0)</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_SETUP</name>
              <description>NWE Setup Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_SETUP</name>
              <description>NCS Setup Length in Write Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_SETUP</name>
              <description>NRD Setup Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_SETUP</name>
              <description>NCS Setup Length in Read Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PULSE0</name>
          <description>SMC Pulse Register (CS_number = 0)</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_PULSE</name>
              <description>NWE Pulse Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_PULSE</name>
              <description>NCS Pulse Length in WRITE Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_PULSE</name>
              <description>NRD Pulse Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_PULSE</name>
              <description>NCS Pulse Length in READ Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CYCLE0</name>
          <description>SMC Cycle Register (CS_number = 0)</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00030003</resetValue>
          <fields>
            <field>
              <name>NWE_CYCLE</name>
              <description>Total Write Cycle Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_CYCLE</name>
              <description>Total Read Cycle Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMINGS0</name>
          <description>SMC Timings Register (CS_number = 0)</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCLR</name>
              <description>CLE to REN Low Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TADL</name>
              <description>ALE to Data Start</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TAR</name>
              <description>ALE to REN Low Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCMS</name>
              <description>Off Chip Memory Scrambling Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRR</name>
              <description>Ready to REN Low Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWB</name>
              <description>WEN High to REN to Busy</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBNSEL</name>
              <description>Ready/Busy Line Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NFSEL</name>
              <description>NAND Flash Selection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE0</name>
          <description>SMC Mode Register (CS_number = 0)</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000003</resetValue>
          <fields>
            <field>
              <name>READ_MODE</name>
              <description>Selection of the Control Signal for Read Operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NCS_CTRL</name>
                  <description>The Read operation is controlled by the NCS signal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NRD_CTRL</name>
                  <description>The Read operation is controlled by the NRD signal.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRITE_MODE</name>
              <description>Selection of the Control Signal for Write Operation</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NCS_CTRL</name>
                  <description>The Write operation is controller by the NCS signal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWE_CTRL</name>
                  <description>The Write operation is controlled by the NWE signal.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXNW_MODE</name>
              <description>NWAIT Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FROZEN</name>
                  <description>Frozen Mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready Mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BAT</name>
              <description>Byte Access Type</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT_8</name>
                  <description>8-bit bus</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT_16</name>
                  <description>16-bit bus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDF_CYCLES</name>
              <description>Data Float Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDF_MODE</name>
              <description>TDF Optimization</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP1</name>
          <description>SMC Setup Register (CS_number = 1)</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_SETUP</name>
              <description>NWE Setup Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_SETUP</name>
              <description>NCS Setup Length in Write Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_SETUP</name>
              <description>NRD Setup Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_SETUP</name>
              <description>NCS Setup Length in Read Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PULSE1</name>
          <description>SMC Pulse Register (CS_number = 1)</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_PULSE</name>
              <description>NWE Pulse Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_PULSE</name>
              <description>NCS Pulse Length in WRITE Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_PULSE</name>
              <description>NRD Pulse Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_PULSE</name>
              <description>NCS Pulse Length in READ Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CYCLE1</name>
          <description>SMC Cycle Register (CS_number = 1)</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00030003</resetValue>
          <fields>
            <field>
              <name>NWE_CYCLE</name>
              <description>Total Write Cycle Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_CYCLE</name>
              <description>Total Read Cycle Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
