NDJSec/FALCON/knowledge_base/svd/data/Atmel/ATSAM3X8H.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SDRAMC</name>
      <version>6100N</version>
      <description>SDRAM Controller</description>
      <prependToName>SDRAMC_</prependToName>
      <baseAddress>0x400E0200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SDRAMC</name>
        <value>10</value>
      </interrupt>
      <registers>
        <register>
          <name>MR</name>
          <description>SDRAMC Mode Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>SDRAMC Command Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, command must be followed by a write to the SDRAM.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOP</name>
                  <description>The SDRAM Controller issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBANKS_PRECHARGE</name>
                  <description>The SDRAM Controller issues an "All Banks Precharge" command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD_MODEREG</name>
                  <description>The SDRAM Controller issues a "Load Mode Register" command when the SDRAM device is accessed regardless of the cycle. To activate this mode, command must be followed by a write to the SDRAM.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO_REFRESH</name>
                  <description>The SDRAM Controller issues an "Auto-Refresh" Command when the SDRAM device is accessed regardless of the cycle. Previously, an "All Banks Precharge" command must be issued. To activate this mode, command must be followed by a write to the SDRAM.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT_LOAD_MODEREG</name>
                  <description>The SDRAM Controller issues an "Extended Load Mode Register" command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the "Extended Load Mode Register" command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEP_POWERDOWN</name>
                  <description>Deep power-down mode. Enters deep power-down mode.</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <description>SDRAMC Refresh Timer Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COUNT</name>
              <description>SDRAMC Refresh Timer Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>SDRAMC Configuration Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x852372C0</resetValue>
          <fields>
            <field>
              <name>NC</name>
              <description>Number of Column Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COL8</name>
                  <description>8 column bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL9</name>
                  <description>9 column bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL10</name>
                  <description>10 column bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL11</name>
                  <description>11 column bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NR</name>
              <description>Number of Row Bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROW11</name>
                  <description>11 row bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROW12</name>
                  <description>12 row bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROW13</name>
                  <description>13 row bits</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB</name>
              <description>Number of Banks</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK2</name>
                  <description>2 banks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK4</name>
                  <description>4 banks</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS Latency</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LATENCY1</name>
                  <description>1 cycle CAS latency</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY2</name>
                  <description>2 cycle CAS latency</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY3</name>
                  <description>3 cycle CAS latency</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWR</name>
              <description>Write Recovery Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRC_TRFC</name>
              <description>Row Cycle Delay and Row Refresh Cycle</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP</name>
              <description>Row Precharge Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRCD</name>
              <description>Row to Column Delay</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRAS</name>
              <description>Active to Precharge Delay</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSR</name>
              <description>Exit Self Refresh to Active Delay</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPR</name>
          <description>SDRAMC Low Power Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LPCB</name>
              <description>Low-power Configuration Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Low Power Feature is inhibited: no Power-down, Self-refresh or Deep Power-down command is issued to the SDRAM device.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_REFRESH</name>
                  <description>The SDRAM Controller issues a Self-refresh command to the SDRAM device, the SDCK clock is deactivated and the SDCKE signal is set low. The SDRAM device leaves the Self Refresh Mode when accessed and enters it after the access.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <description>The SDRAM Controller issues a Power-down Command to the SDRAM device after each access, the SDCKE signal is set to low. The SDRAM device leaves the Power-down Mode when accessed and enters it after the access.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEP_POWER_DOWN</name>
                  <description>The SDRAM Controller issues a Deep Power-down command to the SDRAM device. This mode is unique to low-power SDRAM.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PASR</name>
              <description>Partial Array Self-refresh (only for low-power SDRAM)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCSR</name>
              <description>Temperature Compensated Self-Refresh (only for low-power SDRAM)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DS</name>
              <description>Drive Strength (only for low-power SDRAM)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Time to define when low-power mode is enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_LAST_XFER</name>
                  <description>The SDRAM controller activates the SDRAM low-power mode immediately after the end of the last transfer.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_LAST_XFER_64</name>
                  <description>The SDRAM controller activates the SDRAM low-power mode 64 clock cycles after the end of the last transfer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP_LAST_XFER_128</name>
                  <description>The SDRAM controller activates the SDRAM low-power mode 128 clock cycles after the end of the last transfer.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>SDRAMC Interrupt Enable Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RES</name>
              <description>Refresh Error Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>SDRAMC Interrupt Disable Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RES</name>
              <description>Refresh Error Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>SDRAMC Interrupt Mask Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RES</name>
              <description>Refresh Error Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>SDRAMC Interrupt Status Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RES</name>
              <description>Refresh Error Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDR</name>
          <description>SDRAMC Memory Device Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MD</name>
              <description>Memory Device Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDRAM</name>
                  <description>SDRAM</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSDRAM</name>
                  <description>Low-power SDRAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>SDRAMC Configuration Register 1</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>NC</name>
              <description>Number of Column Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COL8</name>
                  <description>8 column bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL9</name>
                  <description>9 column bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL10</name>
                  <description>10 column bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COL11</name>
                  <description>11 column bits</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NR</name>
              <description>Number of Row Bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROW11</name>
                  <description>11 row bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROW12</name>
                  <description>12 row bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROW13</name>
                  <description>13 row bits</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB</name>
              <description>Number of Banks</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BANK2</name>
                  <description>2 banks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANK4</name>
                  <description>4 banks</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS Latency</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LATENCY1</name>
                  <description>1 cycle CAS latency</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY2</name>
                  <description>2 cycle CAS latency</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LATENCY3</name>
                  <description>3 cycle CAS latency</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBW</name>
              <description>Data Bus Width</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWR</name>
              <description>Write Recovery Delay</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRC_TRFC</name>
              <description>Row Cycle Delay and Row Refresh Cycle</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRP</name>
              <description>Row Precharge Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRCD</name>
              <description>Row to Column Delay</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRAS</name>
              <description>Active to Precharge Delay</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSR</name>
              <description>Exit Self Refresh to Active Delay</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
